In [8]:
#preparing the gold standard for SPIDER 1.0
import json

with open('./DAIL-SQL/dataset/spider/dev.json' , 'r') as f:
    file_bytes = f.read()
    reference_json = json.loads(file_bytes)
for i in reference_json:
    gold_sql = i['query']
    db_id = i['db_id']
    with open('./evaluation/gold_sqls.txt' , 'a') as f:
        f.write(gold_sql + '\t' + db_id + '\n')

In [1]:
#preparing the predictions for SPIDER 1.0
import json
import os
os.remove("./evaluation/pred_sqls.txt")
with open('./llama_pred/SPIDER_beam_4_lenpen01-cluase_step_MBMBR_weighted-tree-based_beams0_4_8_12_16-TEST_SQL_3-SHOT-5Components_EUCDISMASKPRESKLSIMTHR_QA-EXAMPLE_CTX-200_ANS-2048_llama_7bv2.json' , 'r') as f:
    file_bytes = f.read()
    pred_json = json.loads(file_bytes)
for i in pred_json['questions']:
    gold_sql = i['response']
    with open('./evaluation/pred_sqls.txt' , 'a') as f:
        f.write(gold_sql + '\n')

In [3]:
#Running the evaluation for SPIDER 1.0
!python './evaluation/test-suite-sql-eval/evaluation.py' --gold ./evaluation/gold_sqls.txt --pred ./evaluation/pred_sqls.txt --db './DAIL-SQL/dataset/spider/database' --table './DAIL-SQL/dataset/spider/tables.json' --etype all

medium pred: SELECT name , country , age FROM singer ORDER BY age ASC
medium gold: SELECT name ,  country ,  age FROM singer ORDER BY age DESC

medium pred: SELECT t1.Name , t1.Song_release_year FROM singer AS t1 JOIN singer_in_concert AS t2 ON t1.Singer_ID = t2.Singer_ID WHERE t2.concert_ID = 1 ORDER BY t1.Song_release_year LIMIT 1
medium gold: SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1

medium pred: SELECT s.Name, s.Song_release_year FROM singer s JOIN singer_in_concert sc ON sc.Singer_ID = s.Singer_ID WHERE sc.concert_ID = (SELECT min(concert_ID) FROM concert) GROUP BY s.Singer_ID
medium gold: SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1

easy pred: SELECT T1.Country FROM singer T1 WHERE T1.Age > 20
easy gold: SELECT DISTINCT country FROM singer WHERE age  >  20

hard pred: SELECT Song_Name FROM singer WHERE Is_male = true AND Age > Average
hard gold: SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)

hard pred: SELECT T1.Song_Name FROM singer T1 JOIN singer_in_concert T2 ON T1.Singer_ID = T2.Singer_ID WHERE T1.Age > T2.Average
hard gold: SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)

medium pred: SELECT Stadium_ID, Location, Name FROM stadium WHERE Capacity BETWEEN 5000 AND 10000
medium gold: SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000

medium pred: SELECT max(Stadium_ID) , avg(Capacity) FROM stadium
medium gold: select max(capacity), average from stadium

medium pred: SELECT Name, Capacity FROM stadium WHERE Average = (SELECT AVG(Average) FROM stadium)
medium gold: SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1

medium pred: SELECT T2.Name , T2.Capacity FROM stadium T1 , stadium T2 WHERE T1.Stadium_ID = T2.Stadium_ID ORDER BY T2.Average DESC LIMIT 1
medium gold: SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1

medium pred: SELECT Stadium_Name , count(*) FROM concert GROUP BY Stadium_Name
medium gold: SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id

medium pred: SELECT count(*) , stadium_id FROM concert
medium gold: SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id

extra pred: SELECT T1.stadium_name , T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_name , T2.capacity ORDER BY count(*) DESC LIMIT 1
extra gold: SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT T1.Stadium_ID, T1.Name, T1.Capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.Stadium_ID = T2.Stadium_ID GROUP BY T1.Stadium_ID WHERE YEAR = 2013 ORDER BY T2.Year DESC LIMIT 1
extra gold: select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1

hard pred: SELECT Name FROM stadium
hard gold: SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)

hard pred: SELECT "Country" FROM singer WHERE Age > 40 AND Age < 30
hard gold: SELECT country FROM singer WHERE age  >  40 INTERSECT SELECT country FROM singer WHERE age  <  30

hard pred: SELECT T1.Name FROM stadium AS T1 WHERE NOT EXISTS (SELECT T2.Stadium_ID FROM concert AS T2 WHERE T2.Stadium_ID = T1.Stadium_ID AND T2.Year = 2014)
hard gold: SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014

hard pred: SELECT Name FROM stadium WHERE Stadium_ID NOT IN (SELECT concert_ID FROM concert WHERE Year = 2014)
hard gold: SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014

medium pred: SELECT concert_Name , count(*) FROM concert GROUP BY concert_Name
medium gold: SELECT T2.concert_name ,  T2.theme ,  count(*) FROM singer_in_concert AS T1 JOIN concert AS T2 ON T1.concert_id  =  T2.concert_id GROUP BY T2.concert_id

medium pred: SELECT concert_Name , Theme , count(*) FROM concert
medium gold: select t2.concert_name ,  t2.theme ,  count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id  =  t2.concert_id group by t2.concert_id

medium pred: SELECT DISTINCT Singer_ID , count(*) FROM singer_in_concert
medium gold: SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id

medium pred: SELECT S.Name , count(*) FROM singer AS S JOIN singer_in_concert AS SIC ON S.Singer_ID = SIC.Singer_ID GROUP BY S.Name
medium gold: SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id

hard pred: SELECT S.Name FROM singer AS S JOIN singer_in_concert AS T ON S.Singer_ID = T.Singer_ID WHERE T.concert_ID = "2014"
hard gold: SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014

hard pred: SELECT T1.Name FROM singer AS T1 JOIN concert AS T2 ON T1.Singer_ID = T2.Singer_ID WHERE T2.Year = 2014;
hard gold: SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014

medium pred: SELECT s.Name, s.Country FROM singer s WHERE s.Song_Name LIKE "%Hey%"
medium gold: SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'

medium pred: SELECT S1.Name , S1.Country FROM singer AS S1 JOIN singer_in_concert AS S2 ON S1.Singer_ID = S2.Singer_ID WHERE S2.concert_Name = "Hey"
medium gold: SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'

extra pred: SELECT T1.Name , T1.Location FROM stadium AS T1 WHERE T1.Stadium_ID IN (SELECT T2.Stadium_ID FROM concert AS T2 WHERE T2.Year = "2014" AND T2.Year = "2015")
extra gold: SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015

extra pred: SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.Stadium_ID = T2.Stadium_ID WHERE T2.Year = 2014 AND T2.Year = 2015
extra gold: SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015

hard pred: SELECT count(*) FROM concert WHERE stadium_id = (SELECT MAX(stadium_id) FROM stadium)
hard gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)

hard pred: SELECT count(*) FROM concert WHERE stadium_id = 1
hard gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)

easy pred: SELECT count(*) , PetType FROM Has_Pet WHERE weight > 10
easy gold: SELECT count(*) FROM pets WHERE weight  >  10

easy pred: SELECT StuID, count(*) FROM Has_Pet GROUP BY StuID
easy gold: SELECT count(*) FROM pets WHERE weight  >  10

medium pred: SELECT PetType, weight FROM Pets ORDER BY pet_age LIMIT 1
medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1

medium pred: SELECT PetType, weight FROM Pets WHERE PetID = (SELECT StuID FROM Has_Pet WHERE PetID = (SELECT StuID FROM Has_Pet WHERE PetID = (SELECT StuID FROM Has_Pet WHERE
medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1

medium pred: SELECT MAX(weight) , PetType FROM Has_Pet GROUP BY PetType
medium gold: SELECT max(weight) ,  petType FROM pets GROUP BY petType

medium pred: SELECT count(*) , StuID FROM Has_Pet WHERE StuID > 20
medium gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20

medium pred: SELECT StuID, COUNT(*) FROM Has_Pet WHERE StuID > 20 GROUP BY StuID
medium gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20

hard pred: SELECT count(*) FROM Has_Pet WHERE StuID = StuID AND PetID = PetID AND Sex = "F"
hard gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'

hard pred: SELECT StuID, count(*) FROM Has_Pet GROUP BY StuID;
hard gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'

easy pred: SELECT count(DISTINCT PetType) FROM Has_Pet
easy gold: SELECT count(DISTINCT pettype) FROM pets

easy pred: SELECT count(DISTINCT PetType) FROM Has_Pet
easy gold: SELECT count(DISTINCT pettype) FROM pets

extra pred: SELECT StuID, Fname FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet WHERE PetID = 1)
extra gold: SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'

extra pred: SELECT StuID FROM Has_Pet WHERE PetID IN (SELECT PetID FROM Pets WHERE PetType = 'cat') OR PetID IN (SELECT PetID FROM Pets WHERE PetType = 'dog')
extra gold: SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'

extra pred: SELECT Fname FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet WHERE PetID = 1) AND StuID IN (SELECT StuID FROM Has_Pet WHERE PetID = 2)
extra gold: select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'

extra pred: SELECT Fname FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet WHERE PetID IN (SELECT PetID FROM Pets WHERE PetType = 'Cat')) AND StuID IN (SELECT StuID FROM Has_Pet WHERE PetID IN (SELECT PetID FROM Pets WHERE PetType = 'Dog'))
extra gold: SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'

extra pred: SELECT Major, Age FROM Student WHERE StuID NOT IN (SELECT StuID FROM Has_Pet WHERE PetID = 2)
extra gold: SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')

extra pred: SELECT StuID, Major, Age FROM Student WHERE StuID NOT IN (SELECT StuID FROM Has_Pet WHERE PetID = 0)
extra gold: SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')

hard pred: SELECT StuID FROM Has_Pet WHERE PetID IS NULL
hard gold: SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'

hard pred: SELECT DISTINCT StuID FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet WHERE PetID IS NULL)
hard gold: SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'

extra pred: SELECT StuID, LName, Fname, Age FROM Student JOIN Has_Pet ON StuID = PetID WHERE PetType = 'Dog' AND PetID NOT IN (SELECT PetID FROM Has_Pet WHERE PetType = 'Cat')
extra gold: SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')

extra pred: SELECT StuID, LName FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet WHERE PetID = 1) AND StuID NOT IN (SELECT StuID FROM Has_Pet WHERE PetID = 2)
extra gold: SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')

medium pred: SELECT PetType , weight FROM Pets WHERE pet_age = (SELECT min(pet_age) FROM Pets)
medium gold: SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1

medium pred: SELECT PetType, pet_age, weight FROM Has_Pet WHERE StuID = (SELECT StuID FROM Student WHERE Age = (SELECT min(Age) FROM Student));
medium gold: SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1

medium pred: SELECT PetID, weight FROM Pets WHERE age > 1
medium gold: SELECT petid ,  weight FROM pets WHERE pet_age  >  1

medium pred: SELECT avg(pet_age) , max(pet_age) FROM Has_Pet
medium gold: SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype

medium pred: SELECT PetType , avg(weight) FROM Pets
medium gold: SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype

medium pred: SELECT avg(weight) , PetType FROM Has_Pet GROUP BY PetType
medium gold: SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype

medium pred: SELECT StuID, Fname, Age FROM Student JOIN Has_Pet ON StuID = PetID
medium gold: SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid

medium pred: SELECT T1.StuID, T1.Fname, T1.Age FROM Student AS T1 LEFT JOIN Has_Pet AS T2 ON T1.StuID = T2.StuID
medium gold: SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid

medium pred: SELECT StuID, PetID FROM Student, Has_Pet WHERE StuID = 10 AND PetID = (SELECT PetID FROM Has_Pet WHERE StuID = 10)
medium gold: SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'

medium pred: SELECT Stu.StuID, Pet.PetID FROM Student Stu, Has_Pet HP, Pets Pet WHERE Stu.StuID = HP.StuID AND Stu.StuID = Pet.StuID AND Stu.LName = 'Smith'
medium gold: SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'

medium pred: SELECT StuID, count(PetID) FROM Has_Pet GROUP BY StuID
medium gold: SELECT count(*) ,  T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid

medium pred: SELECT StuID , count(*) FROM Has_Pet
medium gold: select count(*) ,  t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid group by t1.stuid

medium pred: SELECT T1.Fname, T1.Sex FROM Student AS T1 JOIN Has_Pet AS T2 ON T1.StuID = T2.StuID
medium gold: SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1

medium pred: SELECT T1.Fname , T1.Sex FROM Student AS T1 JOIN Has_Pet AS T2 ON T1.StuID = T2.StuID GROUP BY T1.Fname , T1.Sex
medium gold: SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1

hard pred: SELECT StuID, LName FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet WHERE PetID = 3)
hard gold: SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'

hard pred: SELECT LName FROM Student WHERE StuID = (SELECT StuID FROM Has_Pet WHERE PetID = (SELECT PetID FROM Pets WHERE PetType = "Cat" AND pet_age = 3));
hard gold: SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'

extra pred: SELECT StuID, avg(pet_age) FROM Student WHERE StuID NOT IN (SELECT StuID FROM Has_Pet)
extra gold: select avg(age) from student where stuid not in (select stuid from has_pet)

extra pred: SELECT avg(Pet_age) FROM Student WHERE StuID NOT IN (SELECT StuID FROM Has_Pet)
extra gold: select avg(age) from student where stuid not in (select stuid from has_pet)

medium pred: SELECT ContId, Continent, COUNT(*) FROM continents GROUP BY ContId, Continent
medium gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;

medium pred: SELECT ContId, Continent, COUNT(CountryId) FROM continents
medium gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;

medium pred: SELECT car_makers.Maker, car_makers.FullName, count(*) FROM car_makers GROUP BY car_makers.Maker
medium gold: SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;

medium pred: SELECT FullName , MakerId , ModelCount FROM car_makers
medium gold: SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;

hard pred: SELECT min(Horsepower) FROM cars_data WHERE MakeId = 1;
hard gold: SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;

hard pred: SELECT T1.Model FROM car_names T1, cars_data T2 WHERE T1.Make = T2.Make AND T2.Horsepower = ( SELECT MIN(Horsepower) FROM cars_data)
hard gold: SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;

extra pred: SELECT Model FROM cars_data WHERE weight < (SELECT avg(weight) FROM cars_data)
extra gold: SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)

extra pred: SELECT T1.Model FROM car_names T1 WHERE T1.Weight < AVG(Weight)
extra gold: SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)

extra pred: SELECT Maker, Model FROM car_names WHERE Year = 1970
extra gold: SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';

extra pred: SELECT DISTINCT T1.Make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.Make = T2.Id WHERE T2.Year = 1970
extra gold: SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';

extra pred: SELECT T1.Make, T2.Year FROM car_names T1, cars_data T2 WHERE T1.Make = T2.Make AND T1.Year = T2.Year
extra gold: SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);

extra pred: SELECT Make, Year FROM cars_data WHERE Year = 1900
extra gold: SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);

hard pred: SELECT DISTINCT Model FROM car_names WHERE Year > 1980
hard gold: SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;


In [26]:
#preparing the gold standard for BIRD
import json

with open('./DAIL-SQL/dataset/bird/dev.json' , 'r') as f:
    file_bytes = f.read()
    reference_json = json.loads(file_bytes)
for i in reference_json:
    gold_sql = i['query']
    db_id = i['db_id']
    with open('./evaluation/gold_sqls_bird.txt' , 'a') as f:
        f.write(gold_sql + '\t' + db_id + '\n')

In [26]:
#preparing the predictions for BIRD
import json
import os
os.remove("./CodeS/codes/pred_sqls_bird.json")
with open('./codeS_pred/codes-1b_beam4_lenpen05_BIRD_MBRbleu_table_num_5_column_num_6_5-shot-5Components_max_tokens_8192_max_new_tokens_256.json' , 'r') as f:
    file_bytes = f.read()
    pred_json = json.loads(file_bytes)

bird_results_dict = dict()

for idx, i in enumerate(pred_json['questions']):
    predicted_sql = i['response']
    db_id = i['db_id']
    bird_results_dict[idx] = predicted_sql + "\t----- bird -----\t" + db_id
    
with open("./CodeS/codes/pred_sqls_bird.json", "w", encoding = 'utf-8') as f:
    f.write(json.dumps(bird_results_dict, indent = 2, ensure_ascii = False))

In [35]:
#Running the evaluation for BIRD
#conda activate codes
#cd /local/ssd_1/yadegari/CodeS/codes/
#sh ./bird_evaluation/run_evaluation.sh pred_sqls_bird.json

/local/ssd_1/yadegari/CodeS/codes
starting to compare with knowledge for ex

/home/yadegari/miniconda3/envs/yadegari_cpu/lib/python3.12/site-packages/IPython/core/magics/osm.py:417: UserWarning: This is now an optional IPython functionality, setting dhist requires you to install the `pickleshare` library.
  self.shell.db['dhist'] = compress_dhist(dhist)[-100:]

Traceback (most recent call last):
  File "/local/ssd_1/yadegari/CodeS/codes/./bird_evaluation/evaluation.py", line 6, in <module>
    from func_timeout import func_timeout, FunctionTimedOut
ModuleNotFoundError: No module named 'func_timeout'
starting to compare with knowledge for ves
Traceback (most recent call last):
  File "/local/ssd_1/yadegari/CodeS/codes/./bird_evaluation/evaluation_ves.py", line 9, in <module>
    from func_timeout import func_timeout, FunctionTimedOut
ModuleNotFoundError: No module named 'func_timeout'

In [40]:
%cd ..

/local/ssd_1/yadegari